#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:[0m
[0m[33mhttps://app.terraform.io/app/azure_website_gh_action/azure-rs/runs/run-n95CmfhafM1PqDUw[0m
[0m
Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_resource_group.tfresource_group[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "tfresource_group" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "centralindia"
      [32m+[0m[0m name     = "example-rg-terraform-example"
    }

[1m  # azurerm_virtual_network.tfvent[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "tfvent" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/16",
        ]
      [32m+[0m[0m dns_servers         = (known after apply)
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "centralindia"
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m resource_group_name = "example-rg-terraform-example"
      [32m+[0m[0m subnet              = (known after apply)
    }

[1m  # random_id.random[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 4
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "my_value" = "constant"
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m address_space       = [
      [32m+[0m[0m "10.0.0.5",
    ]
  [32m+[0m[0m resource_group_name = "EXAMPLE-RG-TERRAFORM-EXAMPLE"
```

</details>

*Pusher: @sumanmanna134, Action: `pull_request`, Workflow: `Pull request Main`*